data/1-replicas/1-producers/1-consumers/10-throughput/0-trial/producer.txt
2018-11-23 22:22:09, 97610 records sent, 19522.0 records/sec (9.53 MB/sec), 5.1 ms avg latency, 258.0 max latency.
2018-11-23 22:22:14, 97729 records sent, 19545.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 7.0 max latency.
2018-11-23 22:22:19, 97721 records sent, 19544.2 records/sec (9.54 MB/sec), 43.3 ms avg latency, 564.0 max latency.
2018-11-23 22:22:24, 97680 records sent, 19528.2 records/sec (9.54 MB/sec), 1.7 ms avg latency, 23.0 max latency.
2018-11-23 22:22:29, 97733 records sent, 19538.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 8.0 max latency.
2018-11-23 22:22:34, 97686 records sent, 19537.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 10.0 max latency.
2018-11-23 22:22:39, 97694 records sent, 19538.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 11.0 max latency.
2018-11-23 22:22:44, 97663 records sent, 19528.7 records/sec (9.54 MB/sec), 1.6 ms avg latency, 19.0 max latency.
2018-11-23 22:22:49, 97720 records sent, 19544.0 records/sec (9.54 MB/sec), 398.2 ms avg latency, 1697.0 max latency.
2018-11-23 22:22:54, 97685 records sent, 19537.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:22:59, 97658 records sent, 19531.6 records/sec (9.54 MB/sec), 1.7 ms avg latency, 5.0 max latency.
2018-11-23 22:23:04, 97725 records sent, 19545.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 21.0 max latency.
2018-11-23 22:23:09, 97643 records sent, 19528.6 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:23:14, 97675 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 6.0 max latency.
2018-11-23 22:23:19, 97713 records sent, 19538.7 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:23:24, 97714 records sent, 19538.9 records/sec (9.54 MB/sec), 531.8 ms avg latency, 2030.0 max latency.
2018-11-23 22:23:29, 97655 records sent, 19531.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 13.0 max latency.
2018-11-23 22:23:34, 97713 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:23:39, 97686 records sent, 19537.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-23 22:23:44, 97683 records sent, 19536.6 records/sec (9.54 MB/sec), 1.7 ms avg latency, 17.0 max latency.
2018-11-23 22:23:49, 97714 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:23:54, 97694 records sent, 19538.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 16.0 max latency.
2018-11-23 22:23:59, 97717 records sent, 19543.4 records/sec (9.54 MB/sec), 1.6 ms avg latency, 6.0 max latency.
2018-11-23 22:24:04, 97632 records sent, 19526.4 records/sec (9.53 MB/sec), 1.6 ms avg latency, 14.0 max latency.
2018-11-23 22:24:09, 97694 records sent, 19538.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:24:14, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:24:19, 97706 records sent, 19541.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 6.0 max latency.
2018-11-23 22:24:24, 70925 records sent, 13950.6 records/sec (6.81 MB/sec), 1.6 ms avg latency, 1453.0 max latency.
2018-11-23 22:24:29, 126034 records sent, 25206.8 records/sec (12.31 MB/sec), 357.8 ms avg latency, 1889.0 max latency.
2018-11-23 22:24:34, 97694 records sent, 19538.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 7.0 max latency.
2018-11-23 22:24:39, 97725 records sent, 19545.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 6.0 max latency.
2018-11-23 22:24:44, 97663 records sent, 19528.7 records/sec (9.54 MB/sec), 1.6 ms avg latency, 13.0 max latency.
2018-11-23 22:24:49, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:24:54, 97714 records sent, 19538.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:25:01, 86796 records sent, 13502.8 records/sec (6.59 MB/sec), 1.6 ms avg latency, 1986.0 max latency.
2018-11-23 22:25:06, 136463 records sent, 27287.1 records/sec (13.32 MB/sec), 373.3 ms avg latency, 1988.0 max latency.
2018-11-23 22:25:11, 97675 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 14.0 max latency.
2018-11-23 22:25:16, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:25:21, 97714 records sent, 19538.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 7.0 max latency.
2018-11-23 22:25:26, 97686 records sent, 19537.2 records/sec (9.54 MB/sec), 1.7 ms avg latency, 15.0 max latency.
2018-11-23 22:25:31, 97702 records sent, 19536.5 records/sec (9.54 MB/sec), 1.7 ms avg latency, 3.0 max latency.
2018-11-23 22:25:36, 97674 records sent, 19530.9 records/sec (9.54 MB/sec), 1.7 ms avg latency, 17.0 max latency.
2018-11-23 22:25:41, 97694 records sent, 19538.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:25:46, 97675 records sent, 19531.1 records/sec (9.54 MB/sec), 1.6 ms avg latency, 16.0 max latency.
2018-11-23 22:25:51, 97714 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:25:56, 97713 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:26:01, 97714 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 6.0 max latency.
2018-11-23 22:26:06, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 15.0 max latency.
2018-11-23 22:26:11, 97696 records sent, 19535.3 records/sec (9.54 MB/sec), 481.7 ms avg latency, 1895.0 max latency.
2018-11-23 22:26:16, 97692 records sent, 19538.4 records/sec (9.54 MB/sec), 1.6 ms avg latency, 25.0 max latency.
2018-11-23 22:26:21, 97675 records sent, 19531.1 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:26:26, 97694 records sent, 19534.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 19.0 max latency.
2018-11-23 22:26:31, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:26:36, 97695 records sent, 19535.1 records/sec (9.54 MB/sec), 1.6 ms avg latency, 6.0 max latency.
2018-11-23 22:26:41, 97693 records sent, 19534.7 records/sec (9.54 MB/sec), 1.6 ms avg latency, 7.0 max latency.
2018-11-23 22:26:46, 97677 records sent, 19535.4 records/sec (9.54 MB/sec), 514.1 ms avg latency, 2021.0 max latency.
2018-11-23 22:26:51, 97673 records sent, 19534.6 records/sec (9.54 MB/sec), 1.5 ms avg latency, 5.0 max latency.
2018-11-23 22:26:56, 97705 records sent, 19541.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:27:01, 97683 records sent, 19532.7 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:27:06, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 21.0 max latency.
2018-11-23 22:27:11, 97706 records sent, 19541.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:27:16, 97655 records sent, 19531.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 5.0 max latency.
2018-11-23 22:27:21, 97398 records sent, 19479.6 records/sec (9.51 MB/sec), 497.1 ms avg latency, 1973.0 max latency.
2018-11-23 22:27:26, 97943 records sent, 19588.6 records/sec (9.56 MB/sec), 1.5 ms avg latency, 17.0 max latency.
2018-11-23 22:27:31, 97638 records sent, 19527.6 records/sec (9.53 MB/sec), 1.6 ms avg latency, 6.0 max latency.
2018-11-23 22:27:36, 97669 records sent, 19533.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:27:41, 97713 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 10.0 max latency.
2018-11-23 22:27:46, 97675 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 18.0 max latency.
2018-11-23 22:27:51, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:27:56, 63546 records sent, 11989.8 records/sec (5.85 MB/sec), 2.4 ms avg latency, 2050.0 max latency.
2018-11-23 22:28:01, 137682 records sent, 27530.9 records/sec (13.44 MB/sec), 395.8 ms avg latency, 2051.0 max latency.
2018-11-23 22:28:04, 7031250 records sent, 19529.785266 records/sec (9.54 MB/sec), 57.10 ms avg latency, 2051.00 ms max latency, 2 ms 50th, 255 ms 95th, 1600 ms 99th, 1958 ms 99.9th.